#!/usr/bin/env perl

# 所有数字的内部格式都相同，为双精度浮点数，不存在整型运算

# 浮点数直接量
$a = 1.23;
$b = 255.000;
$c = 255.0;
$d = 7.25e45;
$e = -6.5e24;
$f = -12e-24;
$g = -1.2E-23;

# 整数直接量
$h = 0;
$i = 2001;
$j = -40;
$k = 1234567890;
$l = 12_34_56_78_90;
print "$l\n";

# 非十进制的整数直接量
$m = 0377;
$n = 0xff;
$o = 0b11111111;
$p = 0x12_34_56_78;
print "$m\n";
print "$p\n"; # print 打印的默认为十进制

# 数字操作符
$q = 2+3;
$r = 5.1-2.4;
$s = 3*12;
$t = 14/2;
$u = 10.2/0.3;
$v = 10/3;
# 支持取模操作符%，取模操作先取整再求余
$w = 10%3;
$x = 10.5%3.2;
$y = 10.6%3.7; # 取整不进位
# 乘幂
$z = 2**3;
print "$q $r $s $t $u $v $w $x $y $z\n";
